Revit 2027 API
FilterGlobalParameterAssociationRule Class
 A filter rule that operates on global parameters ElementId values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterGlobalParameterAssociationRule : FilterNumericValueRule
Public Class FilterGlobalParameterAssociationRule
	Inherits FilterNumericValueRule
public ref class FilterGlobalParameterAssociationRule : public FilterNumericValueRule
type FilterGlobalParameterAssociationRule =
    class
        inherit FilterNumericValueRule
    end
The FilterGlobalParameterAssociationRule type exposes the following members.
Constructors
Name | Description
FilterGlobalParameterAssociationRule |  Constructs an instance of FilterGlobalParameterAssociationRule.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FilterRule)
RuleValue |  The user-supplied global parameter value against which values from a Revit document will be tested.
Top
Methods
Name | Description
Dispose
(Inherited from FilterRule)
ElementPasses |  Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
(Inherited from FilterRule)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEvaluator |  Gets the evaluator that implements the test for this rule.
(Inherited from FilterNumericValueRule)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRuleParameter |  Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
(Inherited from FilterRule)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEvaluator |  Sets the evaluator that implements the test for this rule.
(Inherited from FilterNumericValueRule)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace